---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor
source: html/c5b45745-011b-e53c-a661-ceda7a6a6f14.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor Method

Creates a default invalid segment id on the network.

## Syntax (C#)
```csharp
public MEPNetworkSegmentId()
```